In [65]:
import mysql.connector as connector
from mysql.connector.pooling import MySQLConnectionPool
from mysql.connector import Error

In [49]:
connection = connector.connect(
    user="root", 
    password="root"
)

In [50]:
cursor = connection.cursor()

In [51]:
# Attempt to create the database 'little_lemon_db'.
# If it already exists, the code first drops the existing database and then recreates it.

try:
    cursor.execute(
        "CREATE DATABASE little_lemon_db"
    )
except:
    cursor.execute(
        "DROP DATABASE little_lemon_db"
    )
    cursor.execute(
        "CREATE DATABASE little_lemon_db"
    )

In [52]:
cursor.execute(
    "USE little_lemon_db"
)

In [53]:
create_menuitem_table = """CREATE TABLE MenuItems (
ItemID INT AUTO_INCREMENT,
Name VARCHAR(200),
Type VARCHAR(100),
Price INT,
PRIMARY KEY (ItemID)
);"""

cursor.execute(create_menuitem_table)

insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

cursor.execute(insert_menuitems)
connection.commit()

In [54]:
create_menu_table = """CREATE TABLE Menus (
MenuID INT,
ItemID INT,
Cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""

cursor.execute(create_menu_table)

insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

cursor.execute(insert_menu)
connection.commit()

In [55]:
create_booking_table = """CREATE TABLE Bookings (
BookingID INT AUTO_INCREMENT,
TableNo INT,
GuestFirstName VARCHAR(100) NOT NULL,
GuestLastName VARCHAR(100) NOT NULL,
BookingSlot TIME NOT NULL,
EmployeeID INT,
PRIMARY KEY (BookingID)
);"""

cursor.execute(create_booking_table)

insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

cursor.execute(insert_bookings)
connection.commit()

In [56]:
create_orders_table = """CREATE TABLE Orders (
OrderID INT,
TableNo INT,
MenuID INT,
BookingID INT,
BillAmount INT,
Quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""

cursor.execute(create_orders_table)

insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

cursor.execute(insert_orders)
connection.commit()

In [57]:
create_employees_table = """CREATE TABLE Employees (
EmployeeID INT AUTO_INCREMENT PRIMARY KEY,
Name VARCHAR (255),
Role VARCHAR (100),
Address VARCHAR (255),
Contact_Number INT,
Email VARCHAR (255),
Annual_Salary VARCHAR (100)
);"""

cursor.execute(create_employees_table)

insert_employees = """
INSERT INTO employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary)
VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

cursor.execute(insert_employees)
connection.commit()

In [59]:
# Set up a connection pool named 'pool_a' with a maximum size of 2.
# This allows multiple connections to the database without needing to establish a new connection each time.

db_config = {
    'database' : 'little_lemon_db', 
    'user' : 'root', 
    'password' : 'root'
}

try:
    pool = MySQLConnectionPool(pool_name='pool_a', 
                               pool_size=2, 
                               **db_config)
    print('Connection pool created with name {}.\nPool size {}'. format(pool.pool_name, pool.pool_size))
except Error as err:
    print('Error code: {}.\nError message:'.format(err.errno, err.msg))

Connection pool created with name pool_a.
Pool size 2

In [60]:
conn_1 = pool.get_connection()
print('conn_1 object created with connection from the pool')

conn_1 object created with connection from the pool

In [61]:
cursor = conn_1.cursor()

In [62]:
cursor.execute(
    "DROP PROCEDURE IF EXISTS PeakHours;"
)

# Define a stored procedure 'PeakHours' that retrieves the peak booking hours.
# The procedure groups bookings by hour and counts the number of bookings for each hour.
# Results are then ordered by the number of bookings in descending order.

peak_hours = """
CREATE PROCEDURE PeakHours()

BEGIN

SELECT HOUR(BookingSlot) AS Booking_hour, COUNT(HOUR(BookingSlot)) AS Booking_no
FROM Bookings
GROUP BY Booking_hour
ORDER BY Booking_no DESC;

END
"""

cursor.execute(peak_hours)
cursor.callproc('PeakHours')

results = next(cursor.stored_results())
dataset = results.fetchall()

for column_id in cursor.stored_results():
    columns = [column[0] for column in column_id.description]

print(columns)
for i in dataset:
    print(i)

['Booking_hour', 'Booking_no']
(19, 2)
(15, 1)
(17, 1)
(18, 1)
(20, 1)

In [63]:
cursor.execute(
    "DROP PROCEDURE IF EXISTS GuestStatus;"
)

# Define a stored procedure 'GuestStatus' that retrieves the status of guests based on the role of the employee handling the booking.
# It joins the 'Bookings' and 'Employees' tables on the EmployeeID.
# The CASE statement determines the status of each booking based on the role of the employee.

guest_status = """
CREATE PROCEDURE GuestStatus()

BEGIN

SELECT
Bookings.BookingID AS OrderNo, 
CONCAT(Bookings.GuestFirstName, ' ', Bookings.GuestLastName) AS GuestName, 
Employees.Role AS Employee, 
CASE
WHEN Employees.Role IN ('Manager', 'Assistant Manager') THEN "Ready to pay"
WHEN Employees.Role = 'Head Chef' THEN "Ready to serve"
WHEN Employees.Role = 'Assistant Chef' THEN "Preparing order"
WHEN Employees.Role = 'Head Waiter' THEN "Order served" 
ELSE "Pending" 
END AS Status

FROM
Bookings

LEFT JOIN
Employees
ON Employees.EmployeeID = Bookings.EmployeeID;

END
"""

cursor.execute(guest_status)
cursor.callproc('GuestStatus')

results = next(cursor.stored_results())
dataset = results.fetchall()

for column_id in cursor.stored_results():
    columns = [column[0] for column in column_id.description]

print(columns)
for i in dataset:
    print(i)

['OrderNo', 'GuestName', 'Employee', 'Status']
(1, 'Anna Iversen', 'Manager', 'Ready to pay')
(2, 'Joakim Iversen', 'Manager', 'Ready to pay')
(3, 'Vanessa McCarthy', 'Head Chef', 'Ready to serve')
(4, 'Marcos Romero', 'Assistant Chef', 'Preparing order')
(5, 'Hiroki Yamane', 'Assistant Manager', 'Ready to pay')
(6, 'Diana Pinto', 'Head Waiter', 'Order served')

In [64]:
conn_1.close()